<!-- add-pr-comment:add-pr-comment -->

## Terraform github repositories plan
```
data.github_team.test_team_access: Reading...
data.github_team.operations_engineering_test: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default: Refreshing state... [id=test-tamf-repo-test-org]
module.ministryofjustice-test.module.test-repo-levg.github_repository.default: Refreshing state... [id=test-repo-levg]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default: Refreshing state... [id=operations-engineering-certificate-renewal]
module.ministryofjustice.module.operations-engineering-reports.github_repository.default: Refreshing state... [id=operations-engineering-reports]
module.ministryofjustice.module.terraform-github-repository.github_repository.default: Refreshing state... [id=terraform-github-repository]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default: Refreshing state... [id=operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default: Refreshing state... [id=operations-engineering-dns-form]
module.ministryofjustice.module.operations-engineering-join-github.github_repository.default: Refreshing state... [id=operations-engineering-join-github]
module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default: Refreshing state... [id=moj-terraform-scim-github]
data.github_team.test_team_access: Read complete after 1s [id=9472191]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_repository.default: Refreshing state... [id=operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-support-metadata.github_repository.default: Refreshing state... [id=operations-engineering-support-metadata]
data.github_team.operations_engineering_test: Read complete after 1s [id=9456244]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default: Refreshing state... [id=tech-docs-github-pages-publisher]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering.github_repository.default: Refreshing state... [id=operations-engineering]
data.github_team.operations_engineering: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_repository.default: Refreshing state... [id=tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_repository.default: Refreshing state... [id=operations-engineering-metadata-poc]
module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default: Refreshing state... [id=operations-engineering-dns-spike]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_repository.default: Refreshing state... [id=operations-engineering-unit-test-generator-poc]
module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default: Refreshing state... [id=operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_repository.default: Refreshing state... [id=operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.test_tamf_repo_2.github_repository.default: Refreshing state... [id=test-tamf-repo-2]
module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default: Refreshing state... [id=operations-engineering-runbooks]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default: Refreshing state... [id=cloud-platform-maintenance-pages]
module.ministryofjustice.module.moj-terraform-aws-sso.github_repository.default: Refreshing state... [id=moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default: Refreshing state... [id=operations-engineering-user-guide]
module.ministryofjustice.module.github-collaborators.github_repository.default: Refreshing state... [id=github-collaborators]
module.ministryofjustice.module.github-actions.github_repository.default: Refreshing state... [id=github-actions]
module.ministryofjustice.module.operations-engineering-devcontainer.github_repository.default: Refreshing state... [id=operations-engineering-devcontainer]
module.ministryofjustice.module.operations-engineering-example.github_repository.default: Refreshing state... [id=operations-engineering-example]
module.ministryofjustice.module.acronyms.github_repository.default: Refreshing state... [id=acronyms]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default: Refreshing state... [id=operations-engineering-octodns-poc]
data.github_team.operations_engineering: Read complete after 6s [id=4192115]
module.ministryofjustice.module.terraform-aws-mtasts.github_repository.default: Refreshing state... [id=terraform-aws-mtasts]
module.ministryofjustice.module.template-documentation-site.github_repository.default: Refreshing state... [id=template-documentation-site]
module.ministryofjustice.module.technical-guidance.github_repository.default: Refreshing state... [id=technical-guidance]
module.ministryofjustice.module.template-repository.github_repository.default: Refreshing state... [id=template-repository]
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Reading...
module.ministryofjustice-test.module.test-repo-levg.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLPRAVc4CyGYH]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret.example_secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf2c4Cyrgo]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_branch_protection.default: Refreshing state... [id=BPR_kwDOI-Hjhc4CwPF_]
module.ministryofjustice.module.operations-engineering-reports.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEpRCis4CwPF-]
module.ministryofjustice-test.module.test-repo-levg.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice-test.module.test_tamf_repo_test_org.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-reports:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-certificate-renewal.data.github_actions_public_key.default: Read complete after 1s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-reports:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-reports:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_branch_protection.default: Refreshing state... [id=BPR_kwDOManiY84DIuFG]
module.ministryofjustice.module.operations-engineering-dns-form.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMDCRNs4DB666]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_branch_protection.default: Refreshing state... [id=BPR_kwDOK636CM4CwPF8]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-github-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLELUgs4CwzoY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-reports.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLWBtds4Cz8XQ]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC4ns4CwPGB]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGION]
module.ministryofjustice.module.operations-engineering-dns-form.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REGION"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REGION]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["DEV_ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-join-github:DEV_ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-join-github.github_actions_variable.default["PROD_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-join-github:PROD_ECR_REPOSITORY]
module.ministryofjustice.module.terraform-github-repository.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-support-metadata.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-scim-github.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoPJ8s4CwGtf]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.tech-docs-monitor.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHQFa_s4CwPiA]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKeC3Jc4CwPGL]
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["ECR_REGISTRY"]: Refreshing state... [id=operations-engineering-metadata-poc:ECR_REGISTRY]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-metadata-poc:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-join-github.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_branch_protection.default: Refreshing state... [id=BPR_kwDOE7RAx84CwPh_]
module.ministryofjustice.module.moj-terraform-scim-github.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL1tpxs4DIuFD]
module.ministryofjustice.module.tech-docs-monitor.data.github_actions_public_key.default: Read complete after 3s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMRCOOM4DF_rj]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-metadata-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLRPf1s4Cyrgn]
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.github_branch_protection.default: Refreshing state... [id=BPR_kwDOL4z9984C-v0W]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMj97Js4DLjTW]
module.ministryofjustice.module.tech-docs-github-pages-publisher.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-issues.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMIbLL84DDdaX]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.moj-terraform-aws-sso.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEYOl7c4CwGtj]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.test_tamf_repo_2.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering.github_branch_protection.default: Refreshing state... [id=BPR_kwDODVCV0c4CwPYY]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-spike.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-devcontainer.github_branch_protection.default: Refreshing state... [id=BPR_kwDOLCkQts4Cv-3X]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEeVbDs4CwGth]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-dns-issues.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.terraform-aws-mtasts.github_branch_protection.default: Refreshing state... [id=BPR_kwDOHWUugs4CwPiH]
module.ministryofjustice.module.github-collaborators.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEoQScc4CwGtd]
module.ministryofjustice.module.moj-terraform-aws-sso.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-runbooks.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKK8OCc4CwPGM]
module.ministryofjustice.module.operations-engineering.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Reading...
module.ministryofjustice.data.aws_secretsmanager_secret_version.example_secret_version: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-2:880656497252:secret:EXAMPLE_SECRET-8FFCA9|AWSCURRENT]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REGION]
module.ministryofjustice.module.operations-engineering-devcontainer.data.github_actions_public_key.default: Read complete after 8s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REGION"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REGION]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["PRODUCTION_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:PRODUCTION_ECR_REPOSITORY]
module.ministryofjustice.module.cloud-platform-maintenance-pages.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKnX9OM4CwPGH]
module.ministryofjustice.module.terraform-aws-mtasts.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-example.github_actions_variable.default["DEVELOPMENT_ECR_REPOSITORY"]: Refreshing state... [id=operations-engineering-example:DEVELOPMENT_ECR_REPOSITORY]
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-octodns-poc.github_branch_protection.default: Refreshing state... [id=BPR_kwDOMK6SNs4DEK2K]
module.ministryofjustice.module.github-collaborators.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-user-guide.github_branch_protection.default: Refreshing state... [id=BPR_kwDOKCGhm84CwPGO]
module.ministryofjustice.module.operations-engineering-runbooks.data.github_actions_public_key.default: Read complete after 7s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.github-actions.github_branch_protection.default: Refreshing state... [id=BPR_kwDODNFKOs4CwGtk]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.acronyms.github_branch_protection.default: Refreshing state... [id=BPR_kwDODR2mI84CwGtl]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-example.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.template-repository.github_branch_protection.default: Refreshing state... [id=BPR_kwDODYkhA84CwPiC]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Reading...
module.ministryofjustice.module.operations-engineering-octodns-poc.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.template-documentation-site.github_branch_protection.default: Refreshing state... [id=BPR_kwDOEQGgTs4CwPiI]
module.ministryofjustice.module.technical-guidance.github_branch_protection.default: Refreshing state... [id=BPR_kwDOBeUD0s4CwPiB]
module.ministryofjustice.module.operations-engineering-user-guide.data.github_actions_public_key.default: Read complete after 4s [id=3380204578043523366]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Reading...
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.push["9472191"]: Refreshing state... [id=9472191:test-tamf-repo-test-org]
module.ministryofjustice.module.github-actions.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice-test.module.test_tamf_repo_test_org.github_team_repository.maintain["9456244"]: Refreshing state... [id=9456244:test-tamf-repo-test-org]
module.ministryofjustice.module.acronyms.data.github_actions_public_key.default: Read complete after 5s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-dns-spike.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-spike]
module.ministryofjustice.module.terraform-aws-mtasts.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-aws-mtasts]
module.ministryofjustice.module.test_tamf_repo_2.github_team_repository.maintain["4192115"]: Refreshing state... [id=4192115:test-tamf-repo-2]
module.ministryofjustice.module.cloud-platform-maintenance-pages.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:cloud-platform-maintenance-pages]
module.ministryofjustice.module.template-repository.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.moj-terraform-scim-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-scim-github]
module.ministryofjustice.module.operations-engineering-metadata-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-metadata-poc]
module.ministryofjustice.module.template-documentation-site.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.operations-engineering-join-github.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-join-github]
module.ministryofjustice.module.operations-engineering-user-guide.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-user-guide]
module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-unit-test-generator-poc]
module.ministryofjustice.module.technical-guidance.data.github_actions_public_key.default: Read complete after 6s [id=3380204578043523366]
module.ministryofjustice.module.github-collaborators.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-collaborators]
module.ministryofjustice.module.operations-engineering-runbooks.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-runbooks]
module.ministryofjustice.module.template-documentation-site.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-documentation-site]
module.ministryofjustice.module.tech-docs-github-pages-publisher.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-github-pages-publisher]
module.ministryofjustice.module.acronyms.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:acronyms]
module.ministryofjustice.module.moj-terraform-aws-sso.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:moj-terraform-aws-sso]
module.ministryofjustice.module.operations-engineering-documentation-browser-extension.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-documentation-browser-extension]
module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-kpi-dashboard]
module.ministryofjustice.module.operations-engineering-example.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-example]
module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-find-a-github-repository-owner]
module.ministryofjustice.module.operations-engineering-certificate-renewal.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-certificate-renewal]
module.ministryofjustice.module.template-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:template-repository]
module.ministryofjustice.module.operations-engineering-dns-issues.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-issues]
module.ministryofjustice.module.operations-engineering.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering]
module.ministryofjustice.module.tech-docs-monitor.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:tech-docs-monitor]
module.ministryofjustice.module.operations-engineering-reports.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-reports]
module.ministryofjustice.module.technical-guidance.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:technical-guidance]
module.ministryofjustice.module.operations-engineering-devcontainer.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-devcontainer]
module.ministryofjustice.module.github-actions.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:github-actions]
module.ministryofjustice.module.operations-engineering-github-actions-dashboard.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-github-actions-dashboard]
module.ministryofjustice.module.operations-engineering-octodns-poc.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-octodns-poc]
module.ministryofjustice.module.operations-engineering-support-metadata.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-support-metadata]
module.ministryofjustice.module.operations-engineering-dns-form.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:operations-engineering-dns-form]
module.ministryofjustice.module.terraform-github-repository.github_team_repository.admin["4192115"]: Refreshing state... [id=4192115:terraform-github-repository]
module.ministryofjustice.module.test_tamf_repo_2.github_actions_secret.default["EXAMPLE_SECRET"]: Refreshing state... [id=test-tamf-repo-2:EXAMPLE_SECRET]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ministryofjustice.module.acronyms.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"cafaad5d4fc9be5e7f74bb08c0bd7f3656961a9f4b0abb2a2496f1bdf221e7f4\"" -> "W/\"92485cdfbc104b56e4f6484554275bd2c0d9c2cbdd411c227b3427c69bae0500\""
        id                          = "acronyms"
        name                        = "acronyms"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.cloud-platform-maintenance-pages.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8f57cb2437bb3a6bd8946203b733d754b28f6fba003d33a47e383d4226b6a29d\"" -> "W/\"c0dfa9e3f9be9140db29bb1c59035e51278065982e7e4105c0e05850472dfd77\""
        id                          = "cloud-platform-maintenance-pages"
        name                        = "cloud-platform-maintenance-pages"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-actions.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"33443b3afccb1ff5558b2cc06f0c4188bcbbe0309f1f31438cdc801621310cdf\"" -> "W/\"5798c93fb10fe57f2d6b752141a911f8659e0c21e5f7c1199ad62a22c107855d\""
        id                          = "github-actions"
        name                        = "github-actions"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.github-collaborators.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"eb8a4c8c3bfab0df88822fc8f98974bfda989ae8a85db2b4386905bf078abd5c\"" -> "W/\"414a0ce91c2a8d882024bf8021bce8b33c9438f6b6a245c887ff2cd3b246b450\""
        id                          = "github-collaborators"
        name                        = "github-collaborators"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.moj-terraform-scim-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"14a06ad4bf686ae3f53d014a8d195dac710ef86c6b2508ca6c6d53fdface65d8\"" -> "W/\"e18dd57989ac28c4fbcdc7fbae790397f67983692694b233ad8ec38eadd7bbed\""
        id                          = "moj-terraform-scim-github"
        name                        = "moj-terraform-scim-github"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"7956e1b80c72c577191950fe1a659468fd8d6cb610b7096af2756f0dc3cd0f6e\"" -> "W/\"8bdf35e0745713b9df75d4ab1273a1cdc0534cd763c01c391df5f58f3b32d94b\""
        id                          = "operations-engineering"
        name                        = "operations-engineering"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-certificate-renewal.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"94e26692b3794d462a698addc27e2314db4a788d15130691796e9228c9cfe289\"" -> "W/\"3d4dd3e6a91be3f983b09411ff6a5c8e51458cf8d460734983135da3f44a13fe\""
        id                          = "operations-engineering-certificate-renewal"
        name                        = "operations-engineering-certificate-renewal"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-form.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"77e69434bff69ef19f2051f3b54000e41d46e16f547e751d0eb5ced3400e74f7\"" -> "W/\"e415cabab70acb9baa4b73e21c8fa07337e170337af17eb6614968aea9e700df\""
        id                          = "operations-engineering-dns-form"
        name                        = "operations-engineering-dns-form"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-issues.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"2df31219726c0479a963f53827d15ba9eaf8ce8e523a941109158b223da21c2b\"" -> "W/\"97d53a067905a2f7d702dad759195e3b4cf9d5a469e6849c87ba37fc628c5112\""
        id                          = "operations-engineering-dns-issues"
        name                        = "operations-engineering-dns-issues"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-dns-spike.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"214397f3f31b07c8d484d30edcb93493315b0046d7c8ad25d5bd79ff35c560ae\"" -> "W/\"695f16f6e3963fb9c0030a510af936b6b7e58bcd4db8aeddeb495830b7754560\""
        id                          = "operations-engineering-dns-spike"
        name                        = "operations-engineering-dns-spike"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-example.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"822d58ae0619f44ee76de38d18e4bad7ef7fb4480735ae4ab47ae59bfac8d7d9\"" -> "W/\"7702047bd37bfd2949b14cdb7366122b5451dd0e962047753f0ede92a4649002\""
        id                          = "operations-engineering-example"
        name                        = "operations-engineering-example"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-find-a-github-repository-owner.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4f6d66755792e17af79a475647579020d5b76e2f2b1419059adf640fec162302\"" -> "W/\"75735ae9179389730e47ef51fde02078fc39a66e46c660c1deeb0decd137c334\""
        id                          = "operations-engineering-find-a-github-repository-owner"
        name                        = "operations-engineering-find-a-github-repository-owner"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-join-github.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"3f1b33e660f8727741d145a8690b589dd3a57d09140d6d1f46fe83351eec273e\"" -> "W/\"2da8488d65201b22adfdd96fbd48018a3afadd2da20e841df3c335b111de5b4a\""
        id                          = "operations-engineering-join-github"
        name                        = "operations-engineering-join-github"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-kpi-dashboard.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"6f58de47f26b47533e7dce2c8f92ee50f80f9899efc84956e90702f96870c82e\"" -> "W/\"d331003e3e0bce735ee2f2a241eb3b7437ec79bbea073333efb3dca879a4a048\""
        id                          = "operations-engineering-kpi-dashboard"
        name                        = "operations-engineering-kpi-dashboard"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-octodns-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"1daef261fb5ad9f26440c2b449ae6b1ccde0656866a9ca03e07f807fd931cb5d\"" -> "W/\"cb0a29c97f8cb14338f03153f4d96f8fca68358ef9c5bc6c043d64881d5ea243\""
        id                          = "operations-engineering-octodns-poc"
        name                        = "operations-engineering-octodns-poc"
        # (34 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-reports.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"91dee2473e57426b69778b6c0b2e5b46db8db43067326bc477b3df6f9635b692\"" -> "W/\"a3c2f0f9d977c6e60b76af3ff0f59db36ce8fa53b9adf7f5fa552e4182f655b8\""
        id                          = "operations-engineering-reports"
        name                        = "operations-engineering-reports"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-runbooks.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"3f1114c7d1d55f7b153293f1b246b022bb10f031034e6ea68c3d4e5d0d92f141\"" -> "W/\"d6a503c328d5a49ce55783acd09408133f2607abf8f2c4d79571e3529de5151e\""
        id                          = "operations-engineering-runbooks"
        name                        = "operations-engineering-runbooks"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-unit-test-generator-poc.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"7edbaf52ed9b5eaf56ae7fabd81d7460c9481e9e7189dae28afc67debfaba9ce\"" -> "W/\"9ae7478adc099213fcf6f2145da5d666b4a3bb2d06e6f64ee4cbf1bc737c6101\""
        id                          = "operations-engineering-unit-test-generator-poc"
        name                        = "operations-engineering-unit-test-generator-poc"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.operations-engineering-user-guide.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"5aa4b2a368fb68ec67c8786ede55383046d0227b9f47a6078e11823dbf9fd206\"" -> "W/\"fe45075e6a93fcea31cafd05171c5f79be2090f1efb914b0d233e2a3aafec779\""
        id                          = "operations-engineering-user-guide"
        name                        = "operations-engineering-user-guide"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.tech-docs-github-pages-publisher.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8cd2eaf0075dee5894c2bd93a6989de7c23ff22bf0e3f4b440eeb4c51e0cd0e2\"" -> "W/\"0da779019ee5b5fd74f7c357ab86baf8561f457d3ee18d304845f4b7bd0b9dce\""
        id                          = "tech-docs-github-pages-publisher"
        name                        = "tech-docs-github-pages-publisher"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.technical-guidance.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"f44784a30df93eae40d41ba17635ff82e2f8e9fbe1c27d530c2af1a5878a9072\"" -> "W/\"d7208d8e1677daf257a6ec27cf73c9f6f516ff8c60454b4905cbff4a25057c49\""
        id                          = "technical-guidance"
        name                        = "technical-guidance"
        # (36 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-documentation-site.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"4def46b7648522ed218acbbef8afc65f81be52fe10ced011fa707fb60e099f78\"" -> "W/\"ae3cd961e5709e9bbe5f22ded5723ec1a18f329ea48e5cade759af7aa2fa7c68\""
        id                          = "template-documentation-site"
        name                        = "template-documentation-site"
        # (36 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.ministryofjustice.module.template-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"59a32bffba394dd405080baf1e7fa67e6c40d4622b0e139f85ebcee4549b359a\"" -> "W/\"70374c967a0c2b62184b7ec3ce428ce06e462612fea8440a44e445cd9302b3a5\""
        id                          = "template-repository"
        name                        = "template-repository"
        # (34 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ministryofjustice.module.terraform-github-repository.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"0e3768180259e1b3203b9c85eeaa10fd1a7f8f6459130d2587fcd639262557ae\"" -> "W/\"a2a991164dae9e4116e8641e324b76c39355372e8223e83da0935bf4e3533f21\""
        id                          = "terraform-github-repository"
        name                        = "terraform-github-repository"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ministryofjustice-test.module.test_tamf_repo_test_org.github_repository.default has changed
  ~ resource "github_repository" "default" {
      ~ etag                        = "W/\"8ee696b56748824d8c258a4244f414af9b9963e4b39e6f8d359e603ad80219e9\"" -> "W/\"2100ea6a6baecc7bf5eeac005673461f54e3ef9a85599360c9667b816900e887\""
        id                          = "test-tamf-repo-test-org"
        name                        = "test-tamf-repo-test-org"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.ministryofjustice.module.operations-engineering-flask-template.data.github_actions_public_key.default will be read during apply
  # (config refers to values not yet known)
 <= data "github_actions_public_key" "default" {
      + id         = (known after apply)
      + key        = (known after apply)
      + key_id     = (known after apply)
      + repository = (known after apply)
    }

  # module.ministryofjustice.module.operations-engineering-flask-template.github_branch_protection.default will be created
  + resource "github_branch_protection" "default" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + require_code_owner_reviews      = true
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + strict = false
        }
    }

  # module.ministryofjustice.module.operations-engineering-flask-template.github_repository.default will be created
  + resource "github_repository" "default" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Template repository containing a Flask application used by the Operations Engineering team. • This repository is defined and managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = true
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "operations-engineering-flask-template"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "operations-engineering",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }

      + template {
          + include_all_branches = false
          + owner                = "ministryofjustice"
          + repository           = "template-repository"
        }
    }

  # module.ministryofjustice.module.operations-engineering-flask-template.github_team_repository.admin["4192115"] will be created
  + resource "github_team_repository" "admin" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "operations-engineering-flask-template"
      + team_id    = "4192115"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```